# Languages and runtime managers
brew "openjdk"
brew "maven"
brew "git"
brew "gh"
brew "ruby"
brew "go"
brew "fnm"
brew "uv"

# Shell
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "tmux"
brew "chezmoi"

# Core CLI
brew "httpie"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "jq"
brew "yq"
brew "tree"
brew "watch"
brew "ctop"
brew "htop"
brew "tealdeer"
brew "just"
brew "zoxide"
brew "git-delta"
brew "lazygit"
brew "mkcert"

# Project maintenance
brew "shellcheck"
brew "shfmt"

# Docker runtime
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"

# Core apps
cask "1password"
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "raycast"
cask "ghostty"
cask "the-unarchiver"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "font-fontawesome"

# VS Code baseline
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "golang.go"
vscode "dbaeumer.vscode-eslint"
vscode "redhat.vscode-yaml"
vscode "redhat.vscode-xml"
vscode "yoavbls.pretty-ts-errors"
vscode "pkief.material-icon-theme"
